#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-Yxt5LNRjZVAjjeY6

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_object.files["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.files["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.files["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.css["static/css/main.073c9b0a.css"] will be created
  + resource "aws_s3_object" "css" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "89d76f95e100fc61f7271096ce86e7fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.073c9b0a.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/css/main.073c9b0a.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.css["static/css/main.073c9b0a.css.map"] will be created
  + resource "aws_s3_object" "css" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "4284557f70f03d562b659f38b01eaa66"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.073c9b0a.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/css/main.073c9b0a.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["favicon.ico"] will be destroyed
  # (because aws_s3_object.files is not in configuration)
  - resource "aws_s3_object" "files" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "c92b85a5b907c70211f4ec25e29a8c4a" -> null
      - force_destroy          = false -> null
      - id                     = "favicon.ico" -> null
      - key                    = "favicon.ico" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/favicon.ico" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.files["index.html"] will be destroyed
  # (because aws_s3_object.files is not in configuration)
  - resource "aws_s3_object" "files" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "b816f1f5abc9c31ee55b5e81a972bbe7" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.files["robots.txt"] will be destroyed
  # (because aws_s3_object.files is not in configuration)
  - resource "aws_s3_object" "files" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "fa1ded1ed7c11438a9b0385b1e112850" -> null
      - force_destroy          = false -> null
      - id                     = "robots.txt" -> null
      - key                    = "robots.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/robots.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.html["index.html"] will be created
  + resource "aws_s3_object" "html" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "95d219399a97849a80163ed9549c6e27"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.ico["favicon.ico"] will be created
  + resource "aws_s3_object" "ico" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = "c92b85a5b907c70211f4ec25e29a8c4a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.js["static/js/787.71e672d5.chunk.js"] will be created
  + resource "aws_s3_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "d95602c8a8bdb73b00fa5ed23e902214"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/787.71e672d5.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/js/787.71e672d5.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.js["static/js/787.71e672d5.chunk.js.map"] will be created
  + resource "aws_s3_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "a124545a507d8b6b2410d0a25e9d7b02"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/787.71e672d5.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/js/787.71e672d5.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js"] will be created
  + resource "aws_s3_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "f5376be217783190e30afe1471a82404"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9e3090d4.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/js/main.9e3090d4.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "b114cc85da504a772f040e3f40f8e46a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9e3090d4.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/js/main.9e3090d4.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js.map"] will be created
  + resource "aws_s3_object" "js" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "b4030ca9ffb0edccf1937f966b8bf9c0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.9e3090d4.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/js/main.9e3090d4.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.json["asset-manifest.json"] will be created
  + resource "aws_s3_object" "json" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "e83c852ba9db975803c4c5bad2ba6749"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/asset-manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.json["manifest.json"] will be created
  + resource "aws_s3_object" "json" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "d9d975cebe2ec20b6c652e1e4c12ccf0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.media["static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"] will be created
  + resource "aws_s3_object" "media" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "06e733283fa43d1dd57738cfc409adbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.png["logo192.png"] will be created
  + resource "aws_s3_object" "png" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/x-png"
      + etag                   = "33dbdd0177549353eeeb785d02c294af"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/logo192.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.png["logo512.png"] will be created
  + resource "aws_s3_object" "png" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/x-png"
      + etag                   = "917515db74ea8d1aee6a246cfbcc0b45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/logo512.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.text["robots.txt"] will be created
  + resource "aws_s3_object" "text" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain"
      + etag                   = "fa1ded1ed7c11438a9b0385b1e112850"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 15 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - js_files = [
      - "css/main.073c9b0a.css",
      - "css/main.073c9b0a.css.map",
      - "js/787.71e672d5.chunk.js",
      - "js/787.71e672d5.chunk.js.map",
      - "js/main.9e3090d4.js",
      - "js/main.9e3090d4.js.LICENSE.txt",
      - "js/main.9e3090d4.js.map",
      - "media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg",
    ] -> null
  - test     = "test" -> null

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 19 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*